Revit 2027 API
Settings.ElectricalSetting Property
 Retrieves an object that provides access to all the electrical settings include voltage type, distribution system type, demand factor, wire type in the Autodesk Revit application and project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElectricalSetting ElectricalSetting { get; }
Public ReadOnly Property ElectricalSetting As ElectricalSetting
	Get
public:
property ElectricalSetting^ ElectricalSetting {
	ElectricalSetting^ get ();
}
member ElectricalSetting : ElectricalSetting with get
Property Value
ElectricalSetting
Exceptions
Exception | Condition
InvalidOperationException |  Electrical settings can be accessed only if Revit MEP product is available.
See Also
Reference
Settings Class
Autodesk.Revit.DB Namespace